[
    {
        "title": "1 September",
        "events": [
            {
                "time": "10:30",
                "title": "TrueFi Keynote",
                "speaker": "Bartek Rutkowski (TrueFi)",
                "description": null
            },
            {
                "time": "10:45",
                "title": "Ramp Network Keynote",
                "speaker": "Szymon Sypniewicz (Ramp)",
                "description": null
            },
            {
                "time": "11:00",
                "title": "Flash EVM Oracles & Modular Warp Contracts: a novel approach to on-chain data storage.",
                "speaker": "Jakub Wojciechowski (RedStone)",
                "description": "New DeFi & Web3 projects require diversified data delivered at a higher frequency to get an edge over competitors. However, the biggest bottleneck for Oracles is the high storage costs of EVM which hinder scalability. We'll present how passing data packages to transaction call data could effectively solve that issue and unlock Web3 potential 🚀 Simultaneously EVM blockchains use a monolithic architecture where recording transactions are tightly coupled with the execution layer. We’ll present an alternative approach where transaction ordering is separated from evaluation and state updates, making the architecture million times cheaper and scalable for computation & storage 💽"
            },
            {
                "time": "11:30",
                "title": "Bringing a $450 Trillion TradFi market to DeFi",
                "speaker": "Łukasz Muzyka (IPOR Labs)",
                "description": "There is one type of derivative in TradFi that accounts for 450 trillion dollars in notional value, far surpassing even the total size of the stock market. When you take any loan or make a deposit, your bank uses this derivative to manage its risk. Come to learn what this derivative is, how it works, what it is useful for, and how it’s making its way to DeFi."
            },
            {
                "time": "12:00",
                "title": "Discussion Panel: L2 Solutions & Scalability",
                "speaker": "Moderated by Piotr Szlachciak (L2Beat)",
                "description": "Panelists from Starkware, Adam Gągol (AlephZero), Scroll, ZKX  Many of us have heard about various scaling solutions. We're promised low latency, high volume and negligible fees. And yet the why and how often escapes. Not this time."
            },
            {
                "time": "13:00",
                "title": "🥟Lunch Break",
                "speaker": null,
                "description": null
            },
            {
                "time": "14:00",
                "title": "Introduction to Arweave and the Permaweb",
                "speaker": "Sebastian Campos Groth (Arweave)",
                "description": "In this talk, Arweave COO Sebastian Campos Groth will be going over what Arweave is, including it's unique value proposition of permanent storage, scalability, use cases, and affordability. The talk will be non-technical and focus on the core concepts of the Arweave protocol and it's implications in Web 3.0."
            },
            {
                "time": "14:30",
                "title": "Maker as Backbone Infrastructure for DeFi",
                "speaker": "Sam MacPherson (hexonaut), (MakerDAO)",
                "description": "Maker has gone through a long evolution over the years. In this talk I will present how I view the future of Maker and how it fits into the larger DeFi ecosystem."
            },
            {
                "time": "15:00",
                "title": "Discussion Panel: DAO & Governance",
                "speaker": "Moderated by Nikita Cikaluk",
                "description": "Panelists: Julien Bouteloup (StakeDAO), Nadia Alvarez (MakerDAO), Romain (PaladinDAO), Francesco Andreoli (ConsenSys)"
            },
            {
                "time": "16:00",
                "title": "Create Frictionless Money",
                "speaker": "Miao Zhicheng (Superfluid)",
                "description": "Payment as we know has lots of frictions, with Superfluid money, it becomes truly frictionless, allowing money transferring continuously between accounts with no ongoing cost. In this talk you will learn the basics of the protocol features, how how blockchain enables it and it should also inspire you to create one from scratch!"
            },
            {
                "time": "16:30",
                "title": "Scaling Ethereum with rollups and zero-knowledge-proofs",
                "speaker": "Orest Tarasiuk (Scroll)",
                "description": "Orest will share his personal story of diving deep into the intrinsics of crypto – and gradually making zero-knowledge rollups his new profession. He will give a beginner-friendly introduction to the security-decentralisation-scalability trilemma faced by blockchains and outline how Ethereum hopes to resolve its scalability sacrifice with layer 2 solutions. Finally, he’ll explain why he chose zero-knowledge-proof-based rollups as his favourite tech towards that goal, and at what cost they come. Orest is a computer scientist currently working in crypto, but was founder-CTO in the more traditional mHealth sector in his previous life."
            },
            {
                "time": "17:00",
                "title": "Discussion Panel: DeFi",
                "speaker": "Moderated by Łukasz Stoczyński",
                "description": "Panelists: Rajiv Sainani (MakerDAO), Ryan Rodenbaugh (TrueFi), Romina Bungert (Centrifuge), Christophe Fonteneau (Request Finance)"
            },
            {
                "time": "18:00",
                "title": "Freedom for your data",
                "speaker": "Julian Zawistowski (Wildland)",
                "description": "Wildland is an open source technology that provides reasonably flexible data storage and powerful information management, with an Ethereum-based storage marketplace and implementing the User-Defined Organization & the GLM token in its decentralized governance component. Julian, one of the founders of Golem Foundation which is behind Wildland, will give an introduction to the technology, talk about why the team is developing it & why you might find it exciting - both as a developer and a future user."
            },
            {
                "time": "18:30",
                "title": "MakerDAO Oracle Core Unit Faciliator",
                "speaker": "Nik Kunkel (Chrionicle)",
                "description": "Launched in 2016, MakerDAO's Oracles have been a critical component in securing the Maker Protocol and billions of Dai. Now MakerDAO is launching Chronicle, a community-powered decentralized Oracle protocol. Chronicle will enable anyone to get the same bulletproof Oracles powering Maker, for free. This talk will detail the Chronicle stack, and the exciting future plans for Chronicle."
            },
            {
                "time": "19:00",
                "title": "⚡️Lightning Talk Round⚡️",
                "speaker": "ETHWarsaw Community",
                "description": null
            },
            {
                "time": "19:30",
                "title": "Happy Hour 🍺🍷",
                "speaker": null,
                "description": null
            },
            {
                "time": "21:00",
                "title": "Opening Party 🎉🕺💃",
                "speaker": "Daivinity",
                "description": null
            }
        ]
    },
    {
        "title": "2 September",
        "events": [
            {
                "time": "10:00",
                "title": "The Future of dApps & the Guide to Project Success",
                "speaker": "Kresimir Vuksan (Moralis)",
                "description": "Moralis is a leading Web3 API provider that empowers enterprises to integrate blockchain into everything. Niclas Hallgren (Moralis Tech Lead), and Kresimir Vuskan (Moralis Account Manager) have helped hundreds of projects launch and scale fast using Moralis's time and cost-saving solutions, including Delta, WorldWideWebb, RTKFT, Plasma Finance, and Superfarm. In this talk, they share their insights about the future of dapps, and how to set your project up for success from the start."
            },
            {
                "time": "10:30",
                "title": "Web3 fundamentals - everything you have to know while starting",
                "speaker": "Paweł Łaskarzewski (Synapse Network)",
                "description": "We gonna touch on all the important aspects of web3 fundamentals from the perspective of a developer and business, to bring you closer to the concept of decentralised web, so you can learn about the toolset needed to build solutions on the infrastructure that is the next general purpose technology after the steam engine, the Internet, and AI."
            },
            {
                "time": "11:00",
                "title": "Blockchain gaming reimagined: an old/new engagement model",
                "speaker": "Michał Dąbrowski (Elympics)",
                "description": "Crypto gaming is surrounded by a lot of mystery and stigma because of its recent successes and failures. Can blockchain games even be entertaining? How to achieve player engagement that drives revenue? How to utilize blockchain as a powerful technology from a game development perspective? Let's take a fresh look at crypto games, admitting past mistakes and leading the way forward."
            },
            {
                "time": "11:30",
                "title": "Creating a Web3 Gaming Project on the top of An Existing Game - Reality Metaverse",
                "speaker": "Maciej Burno (Reality Metaverse)",
                "description": "Main focus will be on connecting web 2 and web 3 users by creating a sustainable connection and creating Crypto/NFT project on the top of existing Web 2 game - Landlord GO geolocation property trading game with over 6 M organic downloads."
            },
            {
                "time": "12:00",
                "title": "Web3 credentials 101: where are we, how to use them, where are we going?",
                "speaker": "Wojtek (mazury.xyz)",
                "description": "Web3 offers everybody to own their identity, reputation and credentials across all the internet, which is both:- amazing and convenient- dangerous and a privacy nightmareHow to solve for ideal internet credentials? On chain vs off chain? Privacy preserving or attached to real life identity? Soulbound tokens, verified credentials or just NFTs?In this talk we will go over all web3 credential projects with significant adoption, recognize their tradeoffs and learn how to use web3 tools to build the credentials of the future.Come for top alpha about the following projects :)- achievements: gitpoap / kudos / poap / galaxy- learning: buildspace / 101- work experience: wonderverse / dework- social graph: lens / cyberconnect- writing: mirror- privacy: sismo / disco.xyz- aggregating them all: mazury!"
            },
            {
                "time": "12:30",
                "title": "Soulbound Tokens - the secure and private accumulation of voting rightssecure and private accumulation of voting rights",
                "speaker": "Paweł “Pepesza” Peregud (Wildland)",
                "description": "The talk will introduce the concept of using cryptography to address user privacy and protocol security problems in a project that uses Soulbound Tokens."
            },
            {
                "time": "13:00",
                "title": "🥟Lunch Break",
                "speaker": null,
                "description": null
            },
            {
                "time": "14:00",
                "title": "“We” in web3: the space built by people for people",
                "speaker": "Nikita Cikaluk",
                "description": "The biggest trend in web3 is its community - building for people by people and how traditional brands can benefit from it. With the popularity of DAOs, AMAs, and voting mechanisms, ownership moves from the few to the many, and leaders are more conductors than commanders. A healthy community can help a traditional business develop a better product based on feedback, add more features based on the community's needs, and organically onboard more people. For the first time in history, general users have the power to affect the brands' next step. There is “we” in web 3 for all of these reasons. I would like to dive deeper into 3 factors of community development (connectedness, co-creation, credentials), highlight the ways traditional businesses can build a community in web3 (DAOs, IRL events), and some recent examples (Lacoste, Tag Heuer, KPMG, Adidas)."
            },
            {
                "time": "14:30",
                "title": "DAO101: Build for Success Aleksandra MakerDAO",
                "speaker": "Aleksandra (DAOCraft)",
                "description": "The talk focuses on how to design your DAO to avoid post-decentralization chaos, stagnation and other typical challenges. It brings perspective and learnings to all different members of core teams or DAOs, but it's target audience are founders who have a running project with a central core team and who want to decentralize in the near future (most existing “DAOs” are actually at different points of this stage, even if they already have some governance built in and call themselves a “DAO”). In the talk, I cover 5 core pillars or organization design: leadership, product, monetization, communication and resiliency, discussing them from the perspective of a DAO. I then go through the enablers of successful DAO design, i.e. processes, people and tools. The final objective is to provide listeners with a framework to decentralize in a structured and controlled way, preserving the objectives, principles, values and culture of the initial project."
            },
            {
                "time": "15:00",
                "title": "How to build a great Web3 product roadmap",
                "speaker": "Kasia Sitkiewicz (Github)",
                "description": "Learn from GitHub Product Manager about some best practices around your product management, how to ship small and incremental features, and build a public product roadmap on GitHub."
            },
            {
                "time": "15:30",
                "title": "The State of the gaming industry and how web3 gaming fits into it",
                "speaker": "Joanna frota Kurkowska (G2A.com/Outlier Ventures)",
                "description": "Gaming has been a big driver of on-chain activity (and speculation!) for the last couple of months and has been seen as a future way of web3 mass adoption. But is that true? During the talk we will look at the current state of gaming market, where does the web3 gaming fits and what are the most interesting types of investments in this field today (not a financial advice of course!)."
            },
            {
                "time": "16:00",
                "title": "Introduction to DeFi Bartek Rutkowski",
                "speaker": "Bartek Rutkowski (TrueFi)",
                "description": "It’s been a while since Decentralised Finance has become the hottest trend in the crypto space. But what actually is Decentralised Finance? How does it work? What value does it bring? Why should I care? If you want to find out, this presentation is a must-see!"
            },
            {
                "time": "16:30",
                "title": "How DeFi Lending & liquidation work - explainer for Web2 folks",
                "speaker": "Piotr Duda (DeltaPrime)",
                "description": "Although lending is the second biggest DeFi category, how it works is a mystery even for many crypto-native people. This talk will introduce the basic DeFi lending concepts, show the key differences between TradFi vs. crypto lending and explain what challenges and opportunities it brings. Various approaches will be presented and compared, together with state-of-the-art projects and possible future ways of evolution."
            },
            {
                "time": "17:00",
                "title": "Lightning Talk: Why NFTs will be a Layer 2 for every physical asset?",
                "speaker": "Chris Perdek (Uniqly)",
                "description": "Imagine a world where every physical item has a digital layer of information. The trend of NFTs for physical items will completely transform the fashion industry and the way how we interact with clothes on a daily basis."
            },
            {
                "time": "17:30",
                "title": "About Security: A story written by best Ethereum hacks",
                "speaker": "Marek Kirejczyk (TrueFi)",
                "description": null
            }
        ]
    },
    {
        "title": "3 September",
        "events": [
            {
                "time": "10:30",
                "title": "Dapps, Smart Contracts & Blockchain - everything you wanted to know but were too afraid to ask",
                "speaker": "Michał Sieczkowski (TrueFi)",
                "description": "Intro to the fundamentals of all blockchain systems and then move on to talking about Ethereum itself. I’ll go through the main elements of the system like accounts, transactions and the concept of gas. I’ll briefly talk about Smart Contracts and their application in building Decentralised Applications."
            },
            {
                "time": "11:30",
                "title": "Write & deploy your first Smart Contract on Ethereum PART I",
                "speaker": "Łukasz Stankiewicz (TrueFi)",
                "description": "We’ll first dive into the Solidity syntax to get comfortable reading Solidity code and soon writing some of our own! We’ll learn by examples and get to know the specifics of Smart Contract development. By the end of the workshop we’ll deploy a contract to a live testnet."
            },
            {
                "time": "13:00",
                "title": "🥟Lunch Break",
                "speaker": null,
                "description": null
            },
            {
                "time": "14:00",
                "title": "Testing your Smart Contracts with Waffle",
                "speaker": "Przemysław Rząd (TrueFi)",
                "description": "You will go step by step through Smart Contracts development workflow - Using industry standard contracts, writing Solidity code, compiling and testing. You will get to know EthersJS library, and get some hand-on experience with Solidity and ERC20 tokens."
            },
            {
                "time": "15:00",
                "title": "Build your first Decentralized App! - a frontend for your Smart Contracts",
                "speaker": "Justyna Broniszewska (TrueFi)",
                "description": "During the workshop you will learn how to build decentralized applications using the React library. You'll learn how to interact with blockchain networks by building an application that will connect with contracts created at previous workshops. Additionally, you can receive a set of good practices related to building this type of applications."
            },
            {
                "time": "16:00",
                "title": "Build your first governance contract",
                "speaker": "Marcin Miler (Ramp Network)",
                "description": "In this workshop you will learn about DAO & governance, how it works with a live product like Uniswap, build your own governance contract and test it with a prepared frontend."
            },
            {
                "time": "17:00",
                "title": "Upgradeable Smart Contracts via OpenZeppelin Defender",
                "speaker": "IPOR Labs",
                "description": "In this workshop I will explain the concept of proxy and upgradeable smart contracts based on OpenZeppelin implementations, how to prepare migrations, how to setup Gnosis Multisig and use it in Timelock using OpenZeppelin Defender platform."
            },
            {
                "time": "10:00",
                "title": "Beyond ZK-SNARKs: overview of blockchain privacy paradigms",
                "speaker": "Adam Gągol (Aleph Zero)",
                "description": "For now, blockchain privacy is associated almost exclusively with ZKPs (mostly ZK-SNARKs, recently also ZK-STARKs), but in fact it is only one of privacy paradigms, which has its limitations. During the talk, I'll will present a rough framework describing what can and can not be achieved with ZKP, and then focus on other cryptographic primitives, namely, trusted execution environments (TEE), and multiparty computation (MPC), in the context of privacy on blockchain."
            },
            {
                "time": "10:30",
                "title": "Workshop: Best Practices in Web3 Coding",
                "speaker": "Michał Bazyli",
                "description": null
            },
            {
                "time": "11:00",
                "title": "Oh Snap! It's MetaMask! Secure plugins with arbitrary JavaScript execution",
                "speaker": "Olaf Tomalka (Metamask)",
                "description": "MetaMask Snaps is a new feature that allows any developer to extend how the wallet operates through arbitrary JavaScript execution. Wait, in your wallet?! Yes! Snaps uses brand new tech called Secure EcmaScript, that allows us to completely confine external JavaScript, so that it can do only what we allow it to do. This talk is a deep-level technological insight into how Secure EcmaScript works behind the scenes, how you can write your own from ground up and what it takes to provide access to external resources without privilege escalation. We're going to be abusing JavaScript pretty strongly - medium to high JavaScript knowledge will be helpful."
            },
            {
                "time": "11:30",
                "title": "Getting on Starknet at Warp Speed",
                "speaker": "Jorik Schellekens (Nethermind)",
                "description": "Warp's shiny new 2.0 release makes deploying your Solidity onto StarkNet easy. Follow along with this live coding demo (brace yourselves) of some transpilation examples and their deployment on StarkNet. We'll cover some examples of the changes you would need to make to accommodate Cario's semantics, we'll do a deep dive on some of the transformations the transpiler does, and finally, we'll discuss the future roadmap of the transpiler."
            },
            {
                "time": "12:00",
                "title": "Discussion Panel: Web3 Trends",
                "speaker": "Mod: Brian McGleenon (Yahoo Finance)",
                "description": "Sumit Kishore (Consensys), Paulina Jóśków (Ramp Network), Retro (MakerDAO), Marcin Kaźmierczak (Redstone)"
            },
            {
                "time": "13:00",
                "title": "🥟Lunch Break",
                "speaker": null,
                "description": null
            },
            {
                "time": "14:00",
                "title": "Hacker rant on Truly Unstoppable Organizations",
                "speaker": "Marcin Majchrzak (AngelBlock)",
                "description": "Semi technical deep dive on potential future of DAOs and application of token-based governance systems."
            },
            {
                "time": "14:30",
                "title": "Tips and tricks for cross-domain devs",
                "speaker": "Kris Kaczor (L2Beat)",
                "description": "Cross-domain development raises new interesting challenges. Maintaining two sets of smart contracts that suppose to talk to each during all sorts of network conditions is not exactly trivial. There is a good reason why bridge hacks are so popular. This talk is about lessons learned from building the official DAI bridge for Optimism and Arbitrum rollups."
            },
            {
                "time": "15:00",
                "title": "How to automate your smart contracts using off-chain data & computation",
                "speaker": "Hilmar Orth (Gelato)",
                "description": "Smart contract automation has been one of the key innovations for the DeFi space. We have only just scratched the surface of automation's potential in DeFi , from user-friendly trading strategies to infrastructure-level liquidation protection. The next step is being able to integrate off-chain data into smart contract automation, enabling projects to automatically trigger actions when specified real-world conditions are met. Gelato Network is Web3's premier automation network, enabling developers to automate a wide variety of arbitrary smart contract executions on and across all EVM-compatible blockchains. Examples of use cases developers have built on top of Gelato include Limit Orders on AMMs like Uniswap, automatic compounding of yield farming vaults, Aave liquidation protection, MakerDAO debt ceiling updates, automated liquidity management, and even the petting of Aavegotchis."
            },
            {
                "time": "15:30",
                "title": "zkEVM: compatibility and equivalence",
                "speaker": "Alex Gluchowski (ZkSync)",
                "description": "Alex Gluchowski, co-founder of Ethereum scaling platform zkSync, will offer a look at the importance of zkRollups, the difference between EVM equivalency and EVM compatibility, and the current deployment state amongst zkRollup options."
            },
            {
                "time": "16:00",
                "title": "Discussion Panel: Security",
                "speaker": "Moderated by Marek Kirejczyk (TrueFi)",
                "description": "Panelists: Uri Kirstein (Certora), Kacper Bąk (Quantstamp), Piotr Cielas (Halborn), Damian Rusinek (Composable Security)"
            },
            {
                "time": "17:00",
                "title": "Web3 actions: Scalable Web3 backend",
                "speaker": "Luka Anicin (Tenderly)",
                "description": "Tenderly built Web3 Actions to improve the developer experience and reduce the complexity and costs of setting up a connective layer between Smart Contracts and other components in developers' systems. In essence, Web3 Actions take away the repetitive and time-consuming infrastructural work, allowing you to focus on writing the code to respond when on-chain circumstances or certain off-chain events change. And the goal of this workshop will be to demonstrate just that!"
            },
            {
                "time": "17:30",
                "title": "🤫🤫🤫",
                "speaker": "😎😎😎",
                "description": "🤯🤯🤯"
            },
            {
                "time": "18:00",
                "title": "Hackathon Opening",
                "speaker": null,
                "description": null
            },
            {
                "time": "18:30",
                "title": "Arweave & Warp Contracts Opening Workshop",
                "speaker": "Arweave",
                "description": "Learn how to start with Arweave & Warp Contracts and compete for $10,000 total bounties brought by Warp & RedStone!"
            },
            {
                "time": "🌙",
                "title": "🛠 Overnight hacking session",
                "speaker": null,
                "description": null
            }
        ]
    },
    {
        "title": "3 September",
        "events": [
            {
                "time": "10:00",
                "title": "Finding bugs with formal verification",
                "speaker": "Certora",
                "description": "In this workshop you will learn about the Certora prover and how useful it is for catching bugs. We will briefly explain how it works, and then you’ll get some hands-on experience in writing your first formal verification rules and running them. Please register here: https://www.certora.com/events/ethwarsaw-certora-workshop/ Installation guide: https://docs.google.com/document/d/1XvHLZlPzdu_Ju7FpjoFKh51UFmvcP1lhH3ib0fzHuN8/edit?usp=sharing"
            },
            {
                "time": "12:00",
                "title": "Hackathon oracle integration with a few lines of code & deploying modular smart contracts on Arweave (Workshop)",
                "speaker": "Redstone Finance",
                "description": "Storage-less oracles could become a game-changer for Web3, offering better scalability and shorter data refresh intervals. Simultaneously, modular smart-contract architecture is one of the hottest topics in recent weeks. At this workshop, you'll learn how to integrate Oracle data on a hackathon and how to implement Warp Contracts on top of the Arweave storage chain, allowing you to create unique hackathon projects with heavy data processing requirements.redstone.finance, warp.cc"
            },
            {
                "time": "13:00",
                "title": "🥟Lunch Break",
                "speaker": null,
                "description": null
            },
            {
                "time": "14:00",
                "title": "Hackathon oracle integration with a few lines of code & deploying modular smart contracts on Arweave (Workshop)",
                "speaker": "Redstone Finance",
                "description": "Storage-less oracles could become a game-changer for Web3, offering better scalability and shorter data refresh intervals. Simultaneously, modular smart-contract architecture is one of the hottest topics in recent weeks. At this workshop, you'll learn how to integrate Oracle data on a hackathon and how to implement Warp Contracts on top of the Arweave storage chain, allowing you to create unique hackathon projects with heavy data processing requirements.redstone.finance, warp.cc"
            },
            {
                "time": "15:00",
                "title": "AlephZero & Supercolony workshop",
                "speaker": "AlephZero",
                "description": "TBA"
            },
            {
                "time": "16:00",
                "title": "StarkNet 101 - Introduction to Cairo smart contracts. Unleash the power of ZK-STARKs.",
                "speaker": "StarkWare",
                "description": "You will learn what StarkNet is, how it works and why it's so good. We’ll introduce you to the Cairo language, StarkNet ecosystem and tools. Then, in the practical part, you’ll build and deploy your own smart contract. No prior blockchain experience required, although we assume you have some general programming knowledge."
            },
            {
                "time": "18:00",
                "title": "Hackathon Opening",
                "speaker": null,
                "description": null
            },
            {
                "time": "🌙",
                "title": "🛠 Overnight hacking session",
                "speaker": null,
                "description": null
            }
        ]
    },
    {
        "title": "4 September",
        "events": [
            {
                "time": "09:00",
                "title": "Breakfast with hackers",
                "speaker": null,
                "description": null
            },
            {
                "time": "10:00",
                "title": "Open Mic session",
                "speaker": null,
                "description": null
            },
            {
                "time": "13:00",
                "title": "🥟Lunch with Stani Kulechov (👻AAVE) !!Hackers Only!!",
                "speaker": null,
                "description": null
            },
            {
                "time": "14:00",
                "title": "Panel: How to make your hackathon project stand out",
                "speaker": "Marek Kirejczyk (TrueFi CTO)",
                "description": null
            },
            {
                "time": "15:00",
                "title": "Open Mic session",
                "speaker": null,
                "description": null
            },
            {
                "time": "🌙",
                "title": "🛠 Overnight hacking session",
                "speaker": null,
                "description": null
            },
            {
                "time": "10:00",
                "title": "Hackathon submissions deadline",
                "speaker": null,
                "description": null
            },
            {
                "time": "11:00",
                "title": "Judging sessions for ETHWarsaw Prizes",
                "speaker": null,
                "description": null
            },
            {
                "time": "16:00",
                "title": "Hackathon winners announcement",
                "speaker": null,
                "description": null
            },
            {
                "time": "18:00",
                "title": "🧜‍♀️TrueFi x Ramp x ETHWarsaw After Party!💃",
                "speaker": null,
                "description": null
            }
        ]
    }
]